In [1]:
import pandas as pd

In [3]:
a = pd.Series([-1,1,3,5,7]) #seria

In [4]:
a *10 #mnożymy serie razy 10

0   -10
1    10
2    30
3    50
4    70
dtype: int64

In [6]:
a.abs() #zamiana liczb ujemnych na dodatnie

0    1
1    1
2    3
3    5
4    7
dtype: int64

In [7]:
a.describe() #Liczebność zbioru, srednia , maksymalne, minimalne

count    5.000000
mean     3.000000
std      3.162278
min     -1.000000
25%      1.000000
50%      3.000000
75%      5.000000
max      7.000000
dtype: float64

In [8]:
a.index = ['Pierwsza', 'Druga', 'Trzecia','Czwarta','Piąta'] # zmiana nazw indexu 
a

Pierwsza   -1
Druga       1
Trzecia     3
Czwarta     5
Piąta       7
dtype: int64

In [9]:
a['Piąta'] # dostęp do 5 wartości

7

In [10]:
############# PANDAS DataFrame #############

In [11]:
a = [['Ania',24],['Michal',9],['Darek',40],['Ewa',43]] # nasza lista danych 
df_a = pd.DataFrame(a) # Tworzymy Tabele 
df_a.columns = 'Imię', 'Wiek' #nazywamy kolumny 
df_a

     Imię  Wiek
0    Ania    24
1  Michal     9
2   Darek    40
3     Ewa    43

In [12]:
b = {'Imie':['Mateusz','Daniel','Kondrad','Krzysiek','Kasia'],'Miasta': ['Warszawa','Białystok','Bydgoszcz','Augustów','Rybno']} #Tworzenie Tabeli przy pomocy słownika 
df_b = pd.DataFrame(b)
df_b

       Imie     Miasta
0   Mateusz   Warszawa
1    Daniel  Białystok
2   Kondrad  Bydgoszcz
3  Krzysiek   Augustów
4     Kasia      Rybno

In [13]:
### WCZYTYWANIE PLIKU ###

In [15]:
df = pd.read_csv('Countries.csv')
type(df)

pandas.core.frame.DataFrame

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[:3] # Trzy pierwsze wiersze

,Country,Region,Population,Area sq. mi.,Pop. Density sq. mi.,Coastline coast/area ratio,Net migration,Infant mortality per 1000 births,GDP,Literacy,Phones per 1000,Climate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2",1,"0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2",3,"0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1",1,"0,101","0,6","0,298"

In [18]:
df[['Country','Region']] #Wyświetlanie konkretnych kolumn

             Country                               Region
0       Afghanistan         ASIA (EX. NEAR EAST)
1           Albania   EASTERN EUROPE
2           Algeria   NORTHERN AFRICA
3    American Samoa   OCEANIA
4           Andorra   WESTERN EUROPE
..               ...                                  ...
222       West Bank   NEAR EAST
223  Western Sahara   NORTHERN AFRICA
224           Yemen   NEAR EAST
225          Zambia   SUB-SAHARAN AFRICA
226        Zimbabwe   SUB-SAHARAN AFRICA

[227 rows x 2 columns]

In [19]:
df.iloc[0:3,0:3] # konkretne wiersze które nas interesują i kolumny

        Country                               Region  Population
0  Afghanistan         ASIA (EX. NEAR EAST)             31056997
1      Albania   EASTERN EUROPE                          3581655
2      Algeria   NORTHERN AFRICA                        32930091

In [20]:
df.loc[:3,['Country','Region','Population']] # 3 pierwsze wiersze oraz podane przez nas kolumny

           Country                               Region  Population
0     Afghanistan         ASIA (EX. NEAR EAST)             31056997
1         Albania   EASTERN EUROPE                          3581655
2         Algeria   NORTHERN AFRICA                        32930091
3  American Samoa   OCEANIA                                   57794

In [21]:
df_pop = df[['Country','Region','Population','Phones per 1000']].copy()
df_pop

,Country,Region,Population,Phones per 1000
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,"3,2"
1,Albania,EASTERN EUROPE,3581655,"71,2"
2,Algeria,NORTHERN AFRICA,32930091,"78,1"
3,American Samoa,OCEANIA,57794,"259,5"
4,Andorra,WESTERN EUROPE,71201,"497,2"
...,...,...,...,...
222,West Bank,NEAR EAST,2460492,"145,2"
223,Western Sahara,NORTHERN AFRICA,273008,NaN
224,Yemen,NEAR EAST,21456188,"37,2"
225,Zambia,SUB-SAHARAN AFRICA,11502010,"8,2"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,"26,8"

In [22]:
df_pop['Population'] /= 1000000

In [23]:
df_pop["Nowa kolumna"] = 1

In [24]:
df_pop.head()

,Country,Region,Population,Phones per 1000,Nowa kolumna
0,Afghanistan,ASIA (EX. NEAR EAST),31.056997,"3,2",1
1,Albania,EASTERN EUROPE,3.581655,"71,2",1
2,Algeria,NORTHERN AFRICA,32.930091,"78,1",1
3,American Samoa,OCEANIA,0.057794,"259,5",1
4,Andorra,WESTERN EUROPE,0.071201,"497,2",1